In [1]:
from pandas import Series,DataFrame

In [2]:
import pandas as pd;import numpy as np

In [3]:
obj=Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2=Series([4,7,-5,3],index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [11]:
obj2['d']

4

In [12]:
'd' in obj2

True

In [13]:
obj2['d']=10

In [14]:
obj2

d    10
b     7
a    -5
c     3
dtype: int64

In [15]:
obj2[['d','a','c']]

d    10
a    -5
c     3
dtype: int64

In [16]:
obj2*2

d    20
b    14
a   -10
c     6
dtype: int64

In [17]:
obj2<0

d    False
b    False
a     True
c    False
dtype: bool

In [18]:
obj2[obj2<0]

a   -5
dtype: int64

In [19]:
exp(obj2)

NameError: name 'exp' is not defined

In [20]:
np.exp(obj2)

d    22026.465795
b     1096.633158
a        0.006738
c       20.085537
dtype: float64

In [21]:
sdata={'Ohio':3500,'Texas':7100,'Oregon':16000,'Utah':5000}

In [22]:
obj3=Series(sdata)

In [23]:
obj3

Ohio       3500
Oregon    16000
Texas      7100
Utah       5000
dtype: int64

In [24]:
states=['California','Ohio','Texas']

In [25]:
obj4=Series(sdata,states)

In [26]:
obj4

California       NaN
Ohio          3500.0
Texas         7100.0
dtype: float64

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Texas          True
dtype: bool

In [29]:
obj4.notnull()

California    False
Ohio           True
Texas          True
dtype: bool

In [30]:
obj3+obj4

California        NaN
Ohio           7000.0
Oregon            NaN
Texas         14200.0
Utah              NaN
dtype: float64

In [32]:
obj3.add(obj4,fill_value=0)

California        NaN
Ohio           7000.0
Oregon        16000.0
Texas         14200.0
Utah           5000.0
dtype: float64

In [33]:
obj4.name='population'

In [34]:
obj4

California       NaN
Ohio          3500.0
Texas         7100.0
Name: population, dtype: float64

In [35]:
obj4.index.name='state'

In [36]:
obj4

state
California       NaN
Ohio          3500.0
Texas         7100.0
Name: population, dtype: float64

In [37]:
state2=['mam','woman','girl']

In [38]:
obj5=Series(state2)

In [39]:
obj5

0      mam
1    woman
2     girl
dtype: object

In [43]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}

In [44]:
frame=DataFrame(data)

In [45]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [47]:
frame=DataFrame(data,columns=['year','state','pop'])

In [48]:
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [49]:
frame2=DataFrame(data,columns=['year','state','pop'],index=['one','two','three','four','five'])

In [50]:
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [51]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [52]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [53]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
Name: two, dtype: object